app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'kentutpanjang@gmail.com'
 LIMIT 1
---
    public function processLogin()
    {
        $model = new UserModel();

        $user = $model->where('email', $this->request->getPost('email'))->first();

INSERT INTO `users` (`name`, `email`, `password`, `created_at`, `updated_at`) VALUES ('Kentut', 'kentutpanjang@gmail.com', '$2y$10$QbjUpEkcYrbqCUJ9LOdPoegGjAYK2/cGQltc/duhKAJXxNbSaM69C', '2026-05-05 05:26:31', '2026-05-05 05:26:31')
---
    public function processRegister()
    {
        $model = new UserModel();

        $model->insert([
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
            'password' => password_hash(
                $this->request->getPost('password'),
                PASSWORD_DEFAULT
            )
        ]);