app/Controllers/KecamatanController.php

    public function index()
    {
        // Pagination: 10 data per halaman
        $currentPage = $this->request->getVar('page_kecamatan') ?? 1;
        $data['kecamatan'] = $this->kecamatanModel->paginate(10, 'kecamatan');
---
SELECT *
FROM `kecamatan`
WHERE `kecamatan`.`deleted_at` IS NULL
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `kecamatan`
WHERE `kecamatan`.`deleted_at` IS NULL